{
    "train_delays": {
        "patterns": [
            "is the train delayed",
            "train delay",
            "train running late",
            "is my train on time",
            "train status",
            "is the 0:00 train to X delayed?",
            "are there any dleays on the line to X?",
            "is the train running on time?",
            "what is the status of my train?",
            "is there service to X?",
            "delays",
            "disruptions",
            "is the train on time",
            "running late"
        ],
        "responses": [
            "I can check the status of your train. Please provide the train number and station.",
            "To check for delays, please let me know your train number and departure station."
        ]
    },
    "route_details": {
        "patterns": [
            "route",
            "train route",
            "what is the route to X",
            "what is the route from X to Y",
            "what is the route from Y to X",
            "what is the journey from X to Y",
            "what is the journey from Y to X"
        ],
        "responses": [
            "I can help you with train routes. Please provide your departure and destination stations.",
            "To find the best route, please tell me where you're traveling from and to."
        ]
    },
    "departure_times": {
        "patterns": [
            "departure times",
            "when does the train leave",
            "what time does the train to X leave",
            "departure schedule",
            "when is the next train to X",
            "next train to X"
        ],
        "responses": [
            "I can help you find departure times. Please provide your departure station.",
            "To check departure times, please let me know your departure station."
        ]
    },
    "arrival_times": {
        "patterns": [
            "arrival times",
            "when does the train arrive",
            "what time does the train to X arrive",
            "arrival schedule",
            "when does the train from X arrive"
        ],
        "responses": [
            "I can help you find arrival times. Please provide your destination station.",
            "To check arrival times, please let me know your destination station."
        ]
    },
    "booking_tickets": {
        "patterns": [
            "ticket",
            "i want to book a train",
            "i want to book a ticket",
            "how to book a train",
            "reserve a train ticket",
            "train booking",
            "train reservation",
            "how to get a ticket",
            "i want to go from X to Y",
            "i need a ticket from X to Y",
            "i need a train ticket",
            "i want to travel from X to Y",
            "i want to go to X",
            "i want to go to Y",
            "how do i go from X to Y",
            "how do i get to X",
            "reserve a ticket",
            "book a ticket",   
            "purchase a ticket",
            "buy a ticket"
        ],
        "responses": [
            "I can help you with ticket booking. Please provide your departure and destination stations.",
            "To book tickets, please tell me where you're traveling from and to."
        ]
    },
    "platform_details": {
        "patterns": [
            "platform",
            "which platform",
            "where is platform X",
            "what platform is the train to X",
            "which platform for X",
            "platform number"
        ],
        "responses": [
            "I can help you find the platform. Please provide the train number or destination.",
            "To find the platform, please let me know your train number or destination."
        ]
    },
    "address_details": {
        "patterns": [
            "address",
            "location",
            "where is X",
            "where is Y",
            "what is the address of X"
        ],
        "responses": [
            "I can help you find the address. Please provide the name of the place you're looking for.",
            "To find an address, please tell me the name of the location."
        ]
    },
    "train_operator": {
        "patterns": [
            "operator",
            "train operator",
            "who operates the train to X",
            "who is the operator for X",
            "what is the train operator for X"
        ],
        "responses": [
            "I can help you find the train operator. Please provide the train number or route.",
            "To find the train operator, please let me know the train number or route."
        ]
    },
    "ticket_off_hours": {
        "patterns": [
            "ticket office hours",
            "when is the ticket office open",
            "ticket office",
            "what time does the ticket office open",
            "what time does the ticket office close",
            "ticket office opening hours"
        ],
        "responses": [
            "I can help you with ticket office hours. Please provide the station name.",
            "To find ticket office hours, please tell me the name of the station."
        ]
    },
    "ticket_machine": {
        "patterns": [
            "ticket machine",
            "where is the ticket machine",
            "is there a ticket machine at X",
            "where can I find a ticket machine",
            "ticket vending machine"
        ],
        "responses": [
            "I can help you find a ticket machine. Please provide the station name.",
            "To locate a ticket machine, please tell me the name of the station."
        ]
    },
    "seated_area": {
        "patterns": [
            "seated area",
            "where is the seated area",
            "is there a seated area at X",
            "where can I find a seated area",
            "seating area"
        ],
        "responses": [
            "I can help you find the seated area. Please provide the station name.",
            "To locate a seated area, please tell me the name of the station."
        ]
    },
    "waiting_room": {
        "patterns": [
            "waiting room",
            "where is the waiting room",
            "is there a waiting room at X",
            "where can I find a waiting room",
            "waiting area"
        ],
        "responses": [
            "I can help you find the waiting room. Please provide the station name.",
            "To locate a waiting room, please tell me the name of the station."
        ]
    },
    "toilets": {
        "patterns": [
            "toilets",
            "where are the toilets",
            "is there a toilet at X",
            "where can I find a toilet",
            "restroom"
        ],
        "responses": [
            "I can help you find the toilets. Please provide the station name.",
            "To locate the toilets, please tell me the name of the station."
        ]
    },
    "baby_changing": {
        "patterns": [
            "baby changing",
            "where is the baby changing room",
            "is there a baby changing room at X",
            "where can I find a baby changing room"
        ],
        "responses": [
            "I can help you find the baby changing room. Please provide the station name.",
            "To locate a baby changing room, please tell me the name of the station."
        ]
    },
    "wifi": {
        "patterns": [
            "wifi",
            "is there wifi at X",
            "where can I find wifi",
            "wifi access"
        ],
        "responses": [
            "I can help you find wifi access. Please provide the station name.",
            "To locate wifi access, please tell me the name of the station."
        ]
    },
    "ramp_access": {
        "patterns": [
            "ramp access",
            "is there ramp access at X",
            "where can I find ramp access",
            "accessible facilities"
        ],
        "responses": [
            "I can help you find ramp access. Please provide the station name.",
            "To locate ramp access, please tell me the name of the station."
        ]
    },
    "ticket_gates": {
        "patterns": [
            "ticket gates",
            "are there ticket gates at X",
            "where can I find ticket gates",
            "ticket barriers"
        ],
        "responses": [
            "I can help you find ticket gates. Please provide the station name.",
            "To locate ticket gates, please tell me the name of the station."
        ]
    }
}
